CSI API ETABS v1
cAreaObj.SetLoadUniform Method
 Assigns uniform loads to area objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLoadUniform(
	string Name,
	string LoadPat,
	double Value,
	int Dir,
	bool Replace = true,
	string CSys = "Global",
	eItemType ItemType = eItemType.Objects
)
Function SetLoadUniform (
	Name As String,
	LoadPat As String,
	Value As Double,
	Dir As Integer,
	Optional Replace As Boolean = true,
	Optional CSys As String = "Global",
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim LoadPat As String
Dim Value As Double
Dim Dir As Integer
Dim Replace As Boolean
Dim CSys As String
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetLoadUniform(Name,
	LoadPat, Value, Dir, Replace, CSys,
	ItemType)
int SetLoadUniform(
	String^ Name,
	String^ LoadPat,
	double Value,
	int Dir,
	bool Replace = true,
	String^ CSys = L"Global",
	eItemType ItemType = eItemType::Objects
)
abstract SetLoadUniform :
        Name : string *
        LoadPat : string *
        Value : float *
        Dir : int *
        ?Replace : bool *
        ?CSys : string *
        ?ItemType : eItemType
(* Defaults:
        let _Replace = defaultArg Replace true
        let _CSys = defaultArg CSys "Global"
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing area object or group, depending on the value of the ItemType item.
LoadPat
Type: System.String
 The name of a defined load pattern.
Value
Type: System.Double
 The uniform load value. [F/L2]
Dir
Type: System.Int32
 This is an integer between 1 and 11, indicating the direction of the load.
Local 1 axis (only applies when CSys is Local)
Local 2 axis (only applies when CSys is Local)
Local 3 axis (only applies when CSys is Local)
X direction (does not apply when CSys is Local)
Y direction (does not apply when CSys is Local)
Z direction (does not apply when CSys is Local)
Projected X direction (does not apply when CSys is Local)
Projected Y direction (does not apply when CSys is Local)
Projected Z direction (does not apply when CSys is Local)
Gravity direction (only applies when CSys is Global)
Projected Gravity direction (only applies when CSys is Global)
 The positive gravity direction (see Dir = 10 and 11) is in the negative Global Z direction.
Replace (Optional)
Type: System.Boolean
 If this item is True, all previous uniform loads, if any, assigned to the specified area object(s), in the specified load pattern, are deleted before making the new assignment.
CSys (Optional)
Type: System.String
 This is Local or the name of a defined coordinate system, indicating the coordinate system in which the uniform load is specified.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the area object specified by the Name item.
 If this item is Group, the assignment is made to all area objects in the group specified by the Name item.
 If this item is SelectedObjects, assignment is made to all selected area objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the loads are successfully assigned; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'assign area object uniform loads
  ret = SapModel.AreaObj.SetLoadUniform("ALL", "DEAD", -0.01, 2, False, "Local", eItemType.Group)
'refresh view
   ret = SapModel.View.RefreshView(0, False)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace